of60/tutorials/rheoHeatFoam/OtherTests/channelEDF/PTT/DebyeHuckel/constant/constitutiveProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6.0                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      constitutiveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

parameters
{                
                type             PTT;

                rho              rho [1 -3 0 0 0 0 0] 1000.;
                etaS             etaS [1 -1 -1 0 0 0 0] 0;
                etaP             etaP [1 -1 -1 0 0 0 0] 0.001;             
                lambda           lambda [0 0 1 0 0 0 0] 0.2256;
                epsilon          epsilon [0 0 0 0 0 0 0] .25;
                zeta             zeta [0 0 0 0 0 0 0] 0;
                
                destructionFunctionType  linear;
                
                thermoEta
                {
                  type          ArrheniusModified;
                  alpha         alpha [0 0 0 -1 0 0 0] 0.01;
                  T0            T0 [ 0 0 0 1 0 0 0] 273;
                }
                
                thermoLambda
                {
                  type          ArrheniusModified;
                  alpha         alpha [0 0 0 -1 0 0 0] 0.01;
                  T0            T0 [ 0 0 0 1 0 0 0] 273;
                }
               
                stabilization    BSD;            
}

passiveScalarProperties
{
                solvePassiveScalar   no;
                D                    D [ 0 2 -1 0 0 0 0 ] 1e-9; 
}

// ************************************************************************* //
