of60/tutorials/rheoHeatFoam/OtherTests/channelEDF/PTT/DebyeHuckel/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Get application directory
application=`getApplication`

runApplication blockMesh

runApplication rheoHeatFoam

runApplication postProcess -func sampleDict -latestTime
